data/tests/json/rust_tokio_750_1.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   33.507 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1310000 bytes
Total body sent:        1760000
HTML transferred:       230000 bytes
Requests per second:    298.45 [#/sec] (mean)
Time per request:       2513.014 [ms] (mean)
Time per request:       3.351 [ms] (mean, across all concurrent requests)
Transfer rate:          38.18 [Kbytes/sec] received
                        51.30 kb/s sent
                        89.48 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       23  966 1159.5    313   11107
Processing:    52  387 1038.0    109   24910
Waiting:       24  385 1037.6    108   24910
Total:         88 1353 1600.5   1164   26055

Percentage of the requests served within a certain time (ms)
  50%   1164
  66%   1272
  75%   2161
  80%   2204
  90%   3208
  95%   4199
  98%   5460
  99%   7220
 100%  26055 (longest request)
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)